tap "azure/functions"
tap "azure/kubelogin"
tap "beeftornado/rmtree"
tap "derailed/k9s"
tap "hashicorp/tap"
tap "microsoft/mssql-release"
tap "warrensbox/tap"
brew "azcopy"
brew "xz"
brew "azure-cli"
brew "docker-buildx"
brew "freetds"
brew "git"
brew "git-filter-repo"
brew "glab"
brew "jq"
brew "keyring"
brew "kubernetes-cli"
brew "lastpass-cli"
brew "libfido2"
brew "minikube"
brew "mise"
brew "mysql-client"
brew "node"
brew "pkgconf"
brew "poetry"
brew "postgresql@14", restart_service: :changed
brew "sqlfluff"
brew "stow"
brew "tfenv"
brew "tldr"
brew "uv"
brew "virtualenv"
brew "yq"
brew "azure/functions/azure-functions-core-tools@4"
brew "azure/kubelogin/kubelogin"
brew "derailed/k9s/k9s"
brew "hashicorp/tap/terraform", link: false
cask "alt-tab"
cask "anydesk"
cask "cyberduck"
cask "dbeaver-community"
cask "docker-desktop"
cask "firefox"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "iterm2"
cask "logi-options+"
cask "logseq"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "microsoft-excel"
cask "microsoft-word"
cask "pgadmin4"
cask "rectangle"
cask "slack"
cask "spotify"
cask "tailscale-app"
cask "warrensbox/tap/tfswitch"
cask "visual-studio-code"
cask "vivaldi"
vscode "4ops.terraform"
vscode "azapi-vscode.azapi"
vscode "balazs4.gitlab-pipeline-monitor"
vscode "bastienboutonnet.vscode-dbt"
vscode "be5invis.toml"
vscode "bradzacher.vscode-copy-filename"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "gitlab.gitlab-workflow"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "henriblancke.vscode-dbt-formatter"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "jasonn-porch.gitlab-mr"
vscode "mhutchie.git-graph"
vscode "ms-azure-devops.azure-pipelines"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "rangav.vscode-thunder-client"
vscode "renesaarsoo.sql-formatter-vsc"
vscode "samuelcolvin.jinjahtml"
vscode "snowflake.snowflake-vsc"
vscode "sqlfluff.vscode-sqlfluff"
vscode "vscode-icons-team.vscode-icons"
vscode "yzhang.markdown-all-in-one"
